Tekla Open API Reference for Tekla Structures 2025
Rotation3D Class
Represents 3d rotation of object.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Geometry.Rotation3D
 Namespace: Tekla.Structures.Model.Geometry
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Rotation3D
<SerializableAttribute>
Public Class Rotation3D
The Rotation3D type exposes the following members.
Constructors
Name | Description
Rotation3D()
Initializes a new instance of the Rotation3D class.
Rotation3D(Vector, Vector)
Initializes a new instance of the Rotation3D class.
Top
Properties
Name | Description
AxisX
Gets the X direction.
AxisY
Gets the Y direction.
AxisZ
Gets the Z direction.
Top
Methods
Name | Description
Equals
Compares with another rotation.
FromZRotation
Creates Rotation3D which represents rotation around the Z axis.
Top
See Also
Reference
Tekla.Structures.Model.Geometry Namespace